In [1]:
import pandas as pd
import sklearn
from sklearn.cluster import KMeans

# raw data analysis
Data Download links
http://ocelma.net/MusicRecommendationDataset/lastfm-1K.html -> userid-timestamp-artid-artname-traid-traname.tsv, userid-profile.tsv
http://ocelma.net/MusicRecommendationDataset/lastfm-360K.html ->

In [3]:
data = pd.read_csv('userid-timestamp-artid-artname-traid-traname.tsv',sep = '\t',header = None, error_bad_lines = False)

b'Skipping line 2120260: expected 6 fields, saw 8\n'
b'Skipping line 2446318: expected 6 fields, saw 8\n'
b'Skipping line 11141081: expected 6 fields, saw 8\n'
b'Skipping line 11152099: expected 6 fields, saw 12\nSkipping line 11152402: expected 6 fields, saw 8\n'
b'Skipping line 11882087: expected 6 fields, saw 8\n'
b'Skipping line 12902539: expected 6 fields, saw 8\nSkipping line 12935044: expected 6 fields, saw 8\n'
b'Skipping line 17589539: expected 6 fields, saw 8\n'

In [4]:
data.head()

,0,1,2,3,4,5
0,user_000001,2009-05-04T23:08:57Z,f1b1cf71-bd35-4e99-8624-24a6e15f133a,Deep Dish,NaN,Fuck Me Im Famous (Pacha Ibiza)-09-28-2007
1,user_000001,2009-05-04T13:54:10Z,a7f7df4a-77d8-4f12-8acd-5c60c93f4de8,坂本龍一,NaN,Composition 0919 (Live_2009_4_15)
2,user_000001,2009-05-04T13:52:04Z,a7f7df4a-77d8-4f12-8acd-5c60c93f4de8,坂本龍一,NaN,Mc2 (Live_2009_4_15)
3,user_000001,2009-05-04T13:42:52Z,a7f7df4a-77d8-4f12-8acd-5c60c93f4de8,坂本龍一,NaN,Hibari (Live_2009_4_15)
4,user_000001,2009-05-04T13:42:11Z,a7f7df4a-77d8-4f12-8acd-5c60c93f4de8,坂本龍一,NaN,Mc1 (Live_2009_4_15)

In [5]:
data.columns = ['user_id','timestamp','artist_id','artist_name','song_id','song_name']

In [6]:
data.head()

,user_id,timestamp,artist_id,artist_name,song_id,song_name
0,user_000001,2009-05-04T23:08:57Z,f1b1cf71-bd35-4e99-8624-24a6e15f133a,Deep Dish,NaN,Fuck Me Im Famous (Pacha Ibiza)-09-28-2007
1,user_000001,2009-05-04T13:54:10Z,a7f7df4a-77d8-4f12-8acd-5c60c93f4de8,坂本龍一,NaN,Composition 0919 (Live_2009_4_15)
2,user_000001,2009-05-04T13:52:04Z,a7f7df4a-77d8-4f12-8acd-5c60c93f4de8,坂本龍一,NaN,Mc2 (Live_2009_4_15)
3,user_000001,2009-05-04T13:42:52Z,a7f7df4a-77d8-4f12-8acd-5c60c93f4de8,坂本龍一,NaN,Hibari (Live_2009_4_15)
4,user_000001,2009-05-04T13:42:11Z,a7f7df4a-77d8-4f12-8acd-5c60c93f4de8,坂本龍一,NaN,Mc1 (Live_2009_4_15)

In [7]:
data.describe()

,user_id,timestamp,artist_id,artist_name,song_id,song_name
count,19098853,19098853,18498005,19098853,16936134,19098841
unique,992,17454730,107295,173921,960402,1083471
top,user_000949,2009-02-26T21:29:15Z,a74b1b7f-71a5-4011-9441-d0b5e4122711,Radiohead,db16d0b3-b8ce-4aa8-a11a-e4d53cc7f8a6,Intro
freq,183103,248,115099,115099,3991,17561

In [8]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19098853 entries, 0 to 19098852
Data columns (total 6 columns):
 #   Column       Dtype
---  ------       -----
 0   user_id      object
 1   timestamp    object
 2   artist_id    object
 3   artist_name  object
 4   song_id      object
 5   song_name    object
dtypes: object(6)
memory usage: 874.3+ MB

# user profile data  analysis

In [9]:
user_profile = pd.read_csv('userid-profile.tsv',sep = '\t')

In [10]:
user_profile.head()

           #id gender   age        country    registered
0  user_000001      m   NaN          Japan  Aug 13, 2006
1  user_000002      f   NaN           Peru  Feb 24, 2006
2  user_000003      m  22.0  United States  Oct 30, 2005
3  user_000004      f   NaN            NaN  Apr 26, 2006
4  user_000005      m   NaN       Bulgaria  Jun 29, 2006

In [11]:
user_profile.describe()

              age
count  286.000000
mean    25.367133
std      8.314952
min      3.000000
25%     21.000000
50%     23.000000
75%     28.000000
max    103.000000

In [12]:
user_profile.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 992 entries, 0 to 991
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   #id         992 non-null    object
 1   gender      884 non-null    object
 2   age         286 non-null    float64
 3   country     907 non-null    object
 4   registered  984 non-null    object
dtypes: float64(1), object(4)
memory usage: 38.9+ KB

In [13]:
user_profile.columns

Index(['#id', 'gender', 'age', 'country', 'registered'], dtype='object')

In [14]:
user_profile['age'].max()

103.0

In [15]:
user_profile['age'].min()

3.0

In [17]:
user_profile['age'].value_counts()

21.0     36
22.0     32
23.0     20
20.0     19
24.0     18
19.0     18
26.0     15
25.0     14
29.0     14
28.0     14
27.0     12
18.0     10
30.0      8
34.0      7
33.0      6
32.0      6
31.0      5
35.0      5
38.0      4
36.0      4
17.0      4
42.0      2
39.0      2
40.0      1
7.0       1
4.0       1
15.0      1
48.0      1
55.0      1
103.0     1
16.0      1
75.0      1
49.0      1
3.0       1
Name: age, dtype: int64

In [18]:
user_profile['gender'].value_counts()

m    502
f    382
Name: gender, dtype: int64

In [19]:
user_profile['country'].value_counts()

United States           228
United Kingdom          126
Poland                   50
Germany                  36
Norway                   35
                       ...
Nicaragua                 1
Netherlands Antilles      1
Singapore                 1
Malta                     1
Macedonia                 1
Name: country, Length: 66, dtype: int64

In [22]:
user_profile['registered'].value_counts()

Dec 6, 2005     6
Oct 26, 2005    5
Jan 22, 2006    5
Mar 5, 2006     5
Dec 19, 2006    5
               ..
Oct 28, 2004    1
Jan 4, 2004     1
Nov 24, 2006    1
Aug 14, 2004    1
Dec 5, 2005     1
Name: registered, Length: 625, dtype: int64

# Play Count Analysis

In [2]:
plays_data = pd.read_csv('usersha1-artmbid-artname-plays.tsv',sep = '\t')

In [3]:
plays_data.head()

,00000c289a1829a808ac09c00daf10bc3c4e223b,3bd73256-3905-4f3a-97e2-8b341527f805,betty blowtorch,2137
0,00000c289a1829a808ac09c00daf10bc3c4e223b,f2fb0ff0-5679-42ec-a55c-15109ce6e320,die Ärzte,1099
1,00000c289a1829a808ac09c00daf10bc3c4e223b,b3ae82c2-e60b-4551-a76d-6620f1b456aa,melissa etheridge,897
2,00000c289a1829a808ac09c00daf10bc3c4e223b,3d6bbeb7-f90e-4d10-b440-e153c0d10b53,elvenking,717
3,00000c289a1829a808ac09c00daf10bc3c4e223b,bbd2ffd7-17f4-4506-8572-c1ea58c3f9a8,juliette & the licks,706
4,00000c289a1829a808ac09c00daf10bc3c4e223b,8bfac288-ccc5-448d-9573-c33ea2aa5c30,red hot chili peppers,691

In [4]:
plays_data.columns = ['user_id','artist_id','artist_name','plays']

In [5]:
plays_data.describe()

              plays
count  1.753565e+07
mean   2.151931e+02
std    6.144813e+02
min    0.000000e+00
25%    3.500000e+01
50%    9.400000e+01
75%    2.240000e+02
max    4.191570e+05

In [6]:
plays_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17535654 entries, 0 to 17535653
Data columns (total 4 columns):
 #   Column       Dtype
---  ------       -----
 0   user_id      object
 1   artist_id    object
 2   artist_name  object
 3   plays        int64
dtypes: int64(1), object(3)
memory usage: 535.1+ MB

In [7]:
plays_data.shape

(17535654, 4)

In [8]:
plays_data['plays'].max()

419157

In [9]:
plays_data.columns

Index(['user_id', 'artist_id', 'artist_name', 'plays'], dtype='object')

In [10]:
plays_data['user_id'].nunique()

358868

In [11]:
plays_data.drop('artist_name',axis= 1, inplace= True)

In [12]:
plays_data.head()

,user_id,artist_id,plays
0,00000c289a1829a808ac09c00daf10bc3c4e223b,f2fb0ff0-5679-42ec-a55c-15109ce6e320,1099
1,00000c289a1829a808ac09c00daf10bc3c4e223b,b3ae82c2-e60b-4551-a76d-6620f1b456aa,897
2,00000c289a1829a808ac09c00daf10bc3c4e223b,3d6bbeb7-f90e-4d10-b440-e153c0d10b53,717
3,00000c289a1829a808ac09c00daf10bc3c4e223b,bbd2ffd7-17f4-4506-8572-c1ea58c3f9a8,706
4,00000c289a1829a808ac09c00daf10bc3c4e223b,8bfac288-ccc5-448d-9573-c33ea2aa5c30,691

# Artist Data

In [13]:
artist_data = plays_data[['artist_id','plays']]

In [14]:
artist_data.head()

                              artist_id  plays
0  f2fb0ff0-5679-42ec-a55c-15109ce6e320   1099
1  b3ae82c2-e60b-4551-a76d-6620f1b456aa    897
2  3d6bbeb7-f90e-4d10-b440-e153c0d10b53    717
3  bbd2ffd7-17f4-4506-8572-c1ea58c3f9a8    706
4  8bfac288-ccc5-448d-9573-c33ea2aa5c30    691

In [15]:
artist_aggr = artist_data.groupby('artist_id').sum()

In [16]:
artist_aggr.head()

                                      plays
artist_id
00010eb3-ebfe-4965-81ef-0ac64cd49fde    517
0001cd84-2a11-4699-8d6b-0abf969c5f06   4991
0002260a-b298-48cc-9895-52c9425796b7     69
00026532-1fe3-45fb-a0df-34aec04a1319    321
00026d14-39c6-4f2d-b556-093233b5e714    709

In [17]:
artist_data.shape

(17535654, 2)

In [18]:
artist_aggr.shape

(160112, 1)

In [19]:
artist_aggr.columns

Index(['plays'], dtype='object')

# Clustering on Atrist data

In [20]:
km1 = sklearn.cluster.KMeans(n_clusters = 10)

In [21]:
artist_count = artist_aggr[['plays']]

In [22]:
artist_count.head()

                                      plays
artist_id
00010eb3-ebfe-4965-81ef-0ac64cd49fde    517
0001cd84-2a11-4699-8d6b-0abf969c5f06   4991
0002260a-b298-48cc-9895-52c9425796b7     69
00026532-1fe3-45fb-a0df-34aec04a1319    321
00026d14-39c6-4f2d-b556-093233b5e714    709

In [23]:
km1.fit(artist_count)

KMeans(n_clusters=10)

In [24]:
label1 = km1.labels_

In [25]:
artist_aggr['cluster_id'] = label1

In [26]:
artist_aggr[artist_aggr['cluster_id']  == 7]

                                       plays  cluster_id
artist_id
00034ede-a1f1-4219-be39-02f36853373e  174134           7
000d90ec-d64c-48a1-b775-e726fd240e9f  227645           7
0019749d-ee29-4a5f-ab17-6bfa11deb969  235500           7
00330ad2-6d94-4957-b3b0-7ca1ea6f6fd6  331432           7
00376321-ce0f-4bd7-a98f-fcabdbf06ea7  154451           7
...                                      ...         ...
ffbfc446-f717-4c63-9103-587defe6cf8a  418953           7
ffce4003-a756-46c0-b062-2e942de13d37  130079           7
ffd3ac37-4d0a-42a1-a41e-e160cf60dca5  137376           7
ffe16bba-4d84-409b-8f22-5242c60b930f  363583           7
ffee2206-eb9e-4b39-9447-8977e269ed0e  130583           7

[2916 rows x 2 columns]

# User data (How many times songs played by a user)

In [27]:
user_data = plays_data[['user_id','plays']]

In [28]:
user_data.shape

(17535654, 2)

In [29]:
user_data.head()

                                    user_id  plays
0  00000c289a1829a808ac09c00daf10bc3c4e223b   1099
1  00000c289a1829a808ac09c00daf10bc3c4e223b    897
2  00000c289a1829a808ac09c00daf10bc3c4e223b    717
3  00000c289a1829a808ac09c00daf10bc3c4e223b    706
4  00000c289a1829a808ac09c00daf10bc3c4e223b    691

In [30]:
user_aggr = user_data.groupby('user_id', as_index = False).sum()

In [31]:
user_aggr.head()

                                    user_id   plays
0  00000c289a1829a808ac09c00daf10bc3c4e223b   14579
1  00001411dc427966b17297bf4d69e7e193135d89  119921
2  00004d2ac9316e22dc007ab2243d6fcb239e707d    5770
3  000063d3fe1cf2ba248b9e3c3f0334845a27a6bf     586
4  00007a47085b9aab8af55f52ec8846ac479ac4fe    6115

In [32]:
user_aggr.shape

(358868, 2)

# Clustering on User Data (Silimar users)

In [33]:
user_count = user_aggr[['plays']]

In [34]:
user_count.head()

    plays
0   14579
1  119921
2    5770
3     586
4    6115

In [35]:
km2 = sklearn.cluster.KMeans(n_clusters = 10)

In [36]:
km2.fit(user_count)

KMeans(n_clusters=10)

In [37]:
label2 = km2.labels_

In [38]:
label2

array([2, 9, 7, ..., 7, 7, 0])

In [39]:
user_aggr['cluster_id'] = label2

In [40]:
user_aggr[user_aggr['cluster_id']  == 8]

                                         user_id  plays  cluster_id
5       0000c176103e538d5c9828e695fed4f7ae42dd01  25424           8
10      000163263d2a41a3966a3746855b8b75b7d7aa83  20535           8
42      000752c87a61bc4247f5219b4769c347c0062c8a  21244           8
45      000803131127a67b0c603786c2c20e10e3cbd559  17914           8
47      00087f98b9db64d761d3f1404e1558da9245137a  19646           8
...                                          ...    ...         ...
358813  fff63dc28d57c01c059d2f2d61b983b278cd0fce  23663           8
358825  fff94b39549aa72d76d50be618b90abe44bd0f3f  25389           8
358828  fff9cc8f46f8bcd31402bb9f82e020b5dc387f4b  24221           8
358835  fffa9d62caff0f038c7a35db70f109b1bba04a1d  22994           8
358836  fffaf6f9a1a3ad8bd0dff7b48b2eb9eef030fdee  24429           8

[34365 rows x 3 columns]

# User Profile data

In [41]:
plays_data.head()

,user_id,artist_id,plays
0,00000c289a1829a808ac09c00daf10bc3c4e223b,f2fb0ff0-5679-42ec-a55c-15109ce6e320,1099
1,00000c289a1829a808ac09c00daf10bc3c4e223b,b3ae82c2-e60b-4551-a76d-6620f1b456aa,897
2,00000c289a1829a808ac09c00daf10bc3c4e223b,3d6bbeb7-f90e-4d10-b440-e153c0d10b53,717
3,00000c289a1829a808ac09c00daf10bc3c4e223b,bbd2ffd7-17f4-4506-8572-c1ea58c3f9a8,706
4,00000c289a1829a808ac09c00daf10bc3c4e223b,8bfac288-ccc5-448d-9573-c33ea2aa5c30,691

In [42]:
user_profile = pd.read_csv('usersha1-profile.tsv',sep= '\t',header = None)

In [43]:
user_profile.shape

(359347, 5)

In [44]:
user_profile.head()

,0,1,2,3,4
0,00000c289a1829a808ac09c00daf10bc3c4e223b,f,22.0,Germany,"Feb 1, 2007"
1,00001411dc427966b17297bf4d69e7e193135d89,f,NaN,Canada,"Dec 4, 2007"
2,00004d2ac9316e22dc007ab2243d6fcb239e707d,NaN,NaN,Germany,"Sep 1, 2006"
3,000063d3fe1cf2ba248b9e3c3f0334845a27a6bf,m,19.0,Mexico,"Apr 28, 2008"
4,00007a47085b9aab8af55f52ec8846ac479ac4fe,m,28.0,United States,"Jan 27, 2006"

In [45]:
user_profile.columns = ['user_id','gender','age','country','registerd_on']

In [46]:
user_profile.head()

,user_id,gender,age,country,registerd_on
0,00000c289a1829a808ac09c00daf10bc3c4e223b,f,22.0,Germany,"Feb 1, 2007"
1,00001411dc427966b17297bf4d69e7e193135d89,f,NaN,Canada,"Dec 4, 2007"
2,00004d2ac9316e22dc007ab2243d6fcb239e707d,NaN,NaN,Germany,"Sep 1, 2006"
3,000063d3fe1cf2ba248b9e3c3f0334845a27a6bf,m,19.0,Mexico,"Apr 28, 2008"
4,00007a47085b9aab8af55f52ec8846ac479ac4fe,m,28.0,United States,"Jan 27, 2006"

In [47]:
user_profile.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 359347 entries, 0 to 359346
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       359347 non-null  object
 1   gender        326572 non-null  object
 2   age           284447 non-null  float64
 3   country       359347 non-null  object
 4   registerd_on  359347 non-null  object
dtypes: float64(1), object(4)
memory usage: 13.7+ MB

# Gender Analysis

In [48]:
user_profile['gender'].value_counts()

m    241642
f     84930
Name: gender, dtype: int64

# Age Analysis

In [49]:
user_profile['age'].value_counts()

21.0      24054
20.0      24037
19.0      22261
22.0      22177
23.0      19890
          ...
84.0          5
85.0          4
121.0         2
1002.0        1
666.0         1
Name: age, Length: 113, dtype: int64

# Country Analysis

In [50]:
user_profile['country'].value_counts()

United States         67044
Germany               31651
United Kingdom        29902
Poland                20987
Russian Federation    19833
                      ...
French Guiana             4
Palau                     3
Gambia                    3
Liberia                   3
Benin                     3
Name: country, Length: 239, dtype: int64

# registerd_on analysis

In [51]:
user_profile['registerd_on'].value_counts()

Jan 24, 2008    569
Oct 28, 2008    502
Nov 2, 2008     490
Nov 9, 2008     471
Oct 26, 2008    468
               ...
Sep 15, 2003      1
Oct 16, 2003      1
Sep 20, 2003      1
Oct 15, 2009      1
Jun 27, 2003      1
Name: registerd_on, Length: 2298, dtype: int64

# Merge Datasets

In [52]:
master_data = pd.merge(plays_data,user_profile,on = 'user_id')

In [53]:
master_data.shape

(17535568, 7)

In [54]:
master_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 17535568 entries, 0 to 17535567
Data columns (total 7 columns):
 #   Column        Dtype
---  ------        -----
 0   user_id       object
 1   artist_id     object
 2   plays         int64
 3   gender        object
 4   age           float64
 5   country       object
 6   registerd_on  object
dtypes: float64(1), int64(1), object(5)
memory usage: 1.0+ GB

In [55]:
master_data.head()

,user_id,artist_id,plays,gender,age,country,registerd_on
0,00000c289a1829a808ac09c00daf10bc3c4e223b,f2fb0ff0-5679-42ec-a55c-15109ce6e320,1099,f,22.0,Germany,"Feb 1, 2007"
1,00000c289a1829a808ac09c00daf10bc3c4e223b,b3ae82c2-e60b-4551-a76d-6620f1b456aa,897,f,22.0,Germany,"Feb 1, 2007"
2,00000c289a1829a808ac09c00daf10bc3c4e223b,3d6bbeb7-f90e-4d10-b440-e153c0d10b53,717,f,22.0,Germany,"Feb 1, 2007"
3,00000c289a1829a808ac09c00daf10bc3c4e223b,bbd2ffd7-17f4-4506-8572-c1ea58c3f9a8,706,f,22.0,Germany,"Feb 1, 2007"
4,00000c289a1829a808ac09c00daf10bc3c4e223b,8bfac288-ccc5-448d-9573-c33ea2aa5c30,691,f,22.0,Germany,"Feb 1, 2007"

# Gender Behaviour

In [56]:
gender_data = master_data[['gender','artist_id','plays']]

In [57]:
gender_data.head()

  gender                             artist_id  plays
0      f  f2fb0ff0-5679-42ec-a55c-15109ce6e320   1099
1      f  b3ae82c2-e60b-4551-a76d-6620f1b456aa    897
2      f  3d6bbeb7-f90e-4d10-b440-e153c0d10b53    717
3      f  bbd2ffd7-17f4-4506-8572-c1ea58c3f9a8    706
4      f  8bfac288-ccc5-448d-9573-c33ea2aa5c30    691

In [58]:
gender_aggr = gender_data.groupby(['gender','artist_id'],as_index = False).sum()

In [59]:
gender_aggr.shape

(244352, 3)

In [60]:
gender_aggr.head()

  gender                             artist_id  plays
0      f  00010eb3-ebfe-4965-81ef-0ac64cd49fde     30
1      f  0001cd84-2a11-4699-8d6b-0abf969c5f06    551
2      f  00026532-1fe3-45fb-a0df-34aec04a1319    295
3      f  00026d14-39c6-4f2d-b556-093233b5e714     82
4      f  00027c1d-6307-4e40-b81a-55a560387743    345

# Famous Artists which Male listen to mostly

In [61]:
gender_aggr[gender_aggr['gender'] == 'm'].sort_values(by = 'plays',ascending  = False).head(1)

       gender                             artist_id     plays
199147      m  b10bbbfc-cf9e-42e0-be17-e2c3e1d2600d  20465864

In [62]:
gender_aggr[gender_aggr['gender'] == 'm'].sort_values(by = 'plays',ascending  = False)

       gender                             artist_id     plays
199147      m  b10bbbfc-cf9e-42e0-be17-e2c3e1d2600d  20465864
193468      m  a74b1b7f-71a5-4011-9441-d0b5e4122711  19101652
156088      m  65f4f0c5-ef9e-490c-aee3-909e7ae6b2ab  13073361
173275      m  83d91898-7763-47d7-b03b-b92132375c47  12868359
214725      m  cc197bad-dc9c-440d-a5b5-d52ba2e14234  11173069
...       ...                                   ...       ...
133274      m  3e3e3959-36b5-457c-ae4a-7985abc9fbcc         1
98758       m  0221eb5a-146b-41b0-88d6-468adf617b36         1
198493      m  affca0a1-4765-49dc-8f43-773736d7264b         1
221508      m  d7eca4f5-76e0-45fb-876d-172554f7565a         1
237643      m  f435cebe-83d4-48cb-97fd-d1dfb59dd79a         1

[146829 rows x 3 columns]

# Famous Artists which Female listen to mostly

In [63]:
gender_aggr[gender_aggr['gender'] == 'f'].sort_values(by = 'plays',ascending  = False)

      gender                             artist_id    plays
67491      f  b10bbbfc-cf9e-42e0-be17-e2c3e1d2600d  7390594
63792      f  a74b1b7f-71a5-4011-9441-d0b5e4122711  5817493
77870      f  cc197bad-dc9c-440d-a5b5-d52ba2e14234  4418967
59667      f  9c9f1380-2516-4fc9-a3e6-f9f61941d090  4276872
50590      f  847e8284-8582-4b0e-9c26-b042a4f49e57  3678030
...      ...                                   ...      ...
85539      f  e0224654-f8c7-49c6-97fe-96faaab50f91        1
44953      f  75af066f-4e28-4c8f-9e44-1a9ac224fedc        1
45055      f  75f331df-f740-4997-9913-71c6be48594a        1
5316       f  0dcc30fd-9c85-4666-b432-1308188059e0        1
72268      f  bdbc2cbb-ab5e-42b3-832b-8f22b6d6ce80        1

[97523 rows x 3 columns]

In [64]:
gender_aggr[gender_aggr['gender'] == 'f'].sort_values(by = 'plays',ascending  = False).head(1)

      gender                             artist_id    plays
67491      f  b10bbbfc-cf9e-42e0-be17-e2c3e1d2600d  7390594

# Total songs played by Male vs Female

In [65]:
gender_aggr.groupby('gender').sum()

             plays
gender
f        786779308
m       2652333874

# Age bucket detailed Analysis

In [66]:
age_data = master_data[['age','user_id','artist_id','plays']]

In [67]:
age_data.head()

,age,user_id,artist_id,plays
0,22.0,00000c289a1829a808ac09c00daf10bc3c4e223b,f2fb0ff0-5679-42ec-a55c-15109ce6e320,1099
1,22.0,00000c289a1829a808ac09c00daf10bc3c4e223b,b3ae82c2-e60b-4551-a76d-6620f1b456aa,897
2,22.0,00000c289a1829a808ac09c00daf10bc3c4e223b,3d6bbeb7-f90e-4d10-b440-e153c0d10b53,717
3,22.0,00000c289a1829a808ac09c00daf10bc3c4e223b,bbd2ffd7-17f4-4506-8572-c1ea58c3f9a8,706
4,22.0,00000c289a1829a808ac09c00daf10bc3c4e223b,8bfac288-ccc5-448d-9573-c33ea2aa5c30,691

In [68]:
age_data['age'].value_counts()

20.0      1166404
21.0      1165846
22.0      1079984
19.0      1072002
23.0       970956
           ...
84.0          235
85.0          223
121.0          89
1002.0         50
666.0          48
Name: age, Length: 113, dtype: int64

In [69]:
age_data[age_data['age']>0].sort_values(by = 'age')

,age,user_id,artist_id,plays
13279542,1.0,c21f226bdf410e6542dc357c4457f2681112386a,14b22b4b-06d5-4b82-8284-29d29b58945f,166
11126722,1.0,a2ad16b2afdfd2cbdc8541765a740ce56d4287c0,b10bbbfc-cf9e-42e0-be17-e2c3e1d2600d,31
11126723,1.0,a2ad16b2afdfd2cbdc8541765a740ce56d4287c0,d6e65033-b56a-49df-8744-6fc3ffd75edd,30
11126724,1.0,a2ad16b2afdfd2cbdc8541765a740ce56d4287c0,a9dcefda-9631-44f5-bf94-28b4c83ccfb9,30
11126725,1.0,a2ad16b2afdfd2cbdc8541765a740ce56d4287c0,9c79224c-70cd-4367-8d90-35ca99401b75,29
...,...,...,...,...
12958307,1002.0,bd731c6f4b8e6552c1f8c38b9c320c1cc45276ec,58fffe42-217d-4346-8539-8ddc4f1c7daf,285
12958301,1002.0,bd731c6f4b8e6552c1f8c38b9c320c1cc45276ec,0798d15b-64e2-499f-9969-70167b1d8617,332
12958300,1002.0,bd731c6f4b8e6552c1f8c38b9c320c1cc45276ec,978a36f7-85c6-44ca-a02e-7564e8fa8284,336
12958274,1002.0,bd731c6f4b8e6552c1f8c38b9c320c1cc45276ec,604f273a-d3c1-4b5b-ab83-99541f9368ea,551
12958293,1002.0,bd731c6f4b8e6552c1f8c38b9c320c1cc45276ec,71a94ed8-03cc-459a-bd35-a081ca88a402,382

In [70]:
import numpy as np

In [71]:
age_data = age_data[np.isfinite(age_data['age'])]

In [72]:
def create_bucket(age):
    if age>10 and age < 18:
        return 'b1'
    elif age>=18 and age < 23:
        return 'b2'
    elif age>=23 and age < 28:
        return 'b3'
    elif age>=28 and age < 35:
        return 'b4'
    elif age>=35 and age < 150:
        return 'b5'

In [73]:
age_data['bucket'] = age_data['age'].apply(lambda x: create_bucket(x))

In [74]:
age_data.head()

,age,user_id,artist_id,plays,bucket
0,22.0,00000c289a1829a808ac09c00daf10bc3c4e223b,f2fb0ff0-5679-42ec-a55c-15109ce6e320,1099,b2
1,22.0,00000c289a1829a808ac09c00daf10bc3c4e223b,b3ae82c2-e60b-4551-a76d-6620f1b456aa,897,b2
2,22.0,00000c289a1829a808ac09c00daf10bc3c4e223b,3d6bbeb7-f90e-4d10-b440-e153c0d10b53,717,b2
3,22.0,00000c289a1829a808ac09c00daf10bc3c4e223b,bbd2ffd7-17f4-4506-8572-c1ea58c3f9a8,706,b2
4,22.0,00000c289a1829a808ac09c00daf10bc3c4e223b,8bfac288-ccc5-448d-9573-c33ea2aa5c30,691,b2

In [75]:
age_data.describe()

                age         plays
count  1.389630e+07  1.389630e+07
mean   2.518912e+01  2.278396e+02
std    2.195356e+01  6.333199e+02
min   -1.337000e+03  1.000000e+00
25%    2.000000e+01  3.800000e+01
50%    2.300000e+01  1.020000e+02
75%    2.800000e+01  2.380000e+02
max    1.002000e+03  4.191570e+05

# No.of users in each bucket

In [76]:
age_data[['bucket','user_id']].groupby('bucket').nunique()

        bucket  user_id
bucket
b1           1    20292
b2           1   109386
b3           1    77239
b4           1    45660
b5           1    30267

# Artist choice of each Bucket

In [77]:
age_aggr = age_data[['bucket','artist_id','plays']].groupby(['bucket','artist_id'],as_index = False).sum()

In [79]:
age_aggr.head()

  bucket                             artist_id  plays
0     b1  0001cd84-2a11-4699-8d6b-0abf969c5f06    695
1     b1  0002f649-8285-4a72-b847-b3854e1a449c   2991
2     b1  00034ede-a1f1-4219-be39-02f36853373e  10615
3     b1  0003fd17-b083-41fe-83a9-d550bd4f00a1   1537
4     b1  0004537a-4b12-43eb-a023-04009e738d2e    254

# Artist Choice for different age group

In [80]:
aggr_final = age_aggr[age_aggr['bucket'] == 'b2'].sort_values(by = 'plays', ascending = False)

In [81]:
aggr_final

       bucket                             artist_id     plays
123049     b2  b10bbbfc-cf9e-42e0-be17-e2c3e1d2600d  11007044
119149     b2  a74b1b7f-71a5-4011-9441-d0b5e4122711   9104060
114840     b2  9c9f1380-2516-4fc9-a3e6-f9f61941d090   6998555
133953     b2  cc197bad-dc9c-440d-a5b5-d52ba2e14234   6707053
150576     b2  f59c5520-5f46-4d2c-b2c4-822eabf53419   6700049
...       ...                                   ...       ...
132751     b2  c91d8133-dd0c-4c26-8b89-c2ed991f3966         1
110961     b2  92ba8b63-936f-4c40-a848-75015ed675e0         1
65310      b2  2196067d-73db-4ab0-972d-34aba617a47f         1
55732      b2  09bcde35-8f0c-4e08-b4a3-e184508dfe2b         1
143348     b2  e3ac90f4-72ae-4486-ada9-6051f4aba99a         1

[102848 rows x 3 columns]

# Country detailed Analysis

In [82]:
country_data = user_profile[['country','user_id']]

In [83]:
country_data.head()

         country                                   user_id
0        Germany  00000c289a1829a808ac09c00daf10bc3c4e223b
1         Canada  00001411dc427966b17297bf4d69e7e193135d89
2        Germany  00004d2ac9316e22dc007ab2243d6fcb239e707d
3         Mexico  000063d3fe1cf2ba248b9e3c3f0334845a27a6bf
4  United States  00007a47085b9aab8af55f52ec8846ac479ac4fe

# No. of users country wise

In [85]:
country_data['country'].value_counts()

United States         67044
Germany               31651
United Kingdom        29902
Poland                20987
Russian Federation    19833
                      ...
French Guiana             4
Palau                     3
Gambia                    3
Liberia                   3
Benin                     3
Name: country, Length: 239, dtype: int64